Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--rasdaman_overview.tmx
Source language: en
Languages: ja

source: Multi-Dimensional Big Data Analytics Engine
ja: 多次元ビッグデータ分析エンジン

source: Rasdaman is an Array Database System which provides flexible, fast, scalable geo services for multi-dimensional spatio-temporal sensor, image, simulation, and statistics data of unlimited volume. Ad-hoc access, extraction, aggregation, as well as remix and analytics is enabled through a NewSQL raster query language with highly effective server-side optimization. Cloud/cluster parallelization is accomplished in a secure, administrator-controlled way.
ja: Rasdamanはアレイデータベースシステムであり、多次元時空間センサ、画像、シミュレーション、統計データのための柔軟で高速でスケーラブルな地理サービスを無制限のボリュームで提供します。NewSQL、集約、リミックス、分析は、非常に効果的なサーバサイド最適化を備えたNewSQLラスタクエリ言語を通じて可能になります。クラウド/クラスタの並列化は、管理者が制御する安全な方法で行われます。

source: In addition to the raster query language, rasdaman supports OGC's WMS, WCS and WCPS web service standards, as well as C++ and Java APIs. At https://standards.rasdaman.com a collection of interactive demos is available. A rasdaman driver is part of GDAL and MapServer.
ja: rasdamanでは、ラスタークエリー言語に加えて、OGCのWMS、WCS、OGCのWMS、WCS、WCPSウェブサービス標準をサポートしています。https://standards.rasdaman.comでは、対話型デモのコレクションが利用できます。rasdamanドライバはGDALとMapServerの一部です。

source: Rasdaman has received a series of international innovation awards, among them the prestigeous European IT Prize and Geospatial Innovation Award. Technology is mature and stable, being in operational for more than ten years. Among the operators of rasdaman services are mapping agencies and climate data centers.
ja: Rasdamanは、ヨーロッパIT賞と地理空間イノベーション賞といった、数々の国際的なイノベーション賞を受賞しています。テクノロジーは成熟して安定しており、10年以上にわたって稼働しています。rasdamanサービスの事業者には、地図作成機関と気象データセンターがある。

source: Core Features
ja: 主要機能

source: truly multi-dimensional - 1-D, 2-D, 3-D, 4-D, and beyond
ja: 真の多次元-1D、2D、3D、4D、およびそれ以上

source: powerful, flexible query language for visualization, classification, convolution, aggregation, and many more geospatial functions
ja: 視覚化、分類、畳み込み、集約、その他多くの空間関数に対応する、強力で柔軟なクエリ言語

source: spatial indexing and adaptive tiling for fast data access
ja: 高速データ・アクセスのための空間インデックス作成とアダプティブ・タイリング

source: parallelization and "tile streaming" for unlimited scalability from laptop to cluster and cloud
ja: 並列化と"タイルストリーミング"により、ノートパソコンからクラスタやクラウドまで無制限の拡張性を実現

source: support for the raster-relevant OGC standards, Reference Implementation for WCS Core and WCPS
ja: ラスター関連のOGC標準のサポート、 WCS Core and WCPSの参照実装です

source: Implemented Standards
ja: 実装されている標準規格

source: Details
ja: 詳細

source: **Website:** https://rasdaman.org
ja: **Webサイト:** https://rasdaman.org

source: **Licence:**
ja: **ライセンス:**

source: clients and APIs: GNU Lesser General Public License (LGPL) version 3
ja: クライアントとAPI: GNU Lesser General Public License (LGPL) version 3

source: server engine: GNU General Public License (GPL) version 3
ja: サーバエンジン: GNU General Public License (GPL) version 3

source: **Software Version:** |version-rasdaman|
ja: **ソフトウェアバージョン:** |version-rasdaman|

source: **Supported Platforms:** Linux, MacOS, Solaris
ja: **対応プラットフォーム:** Linux, MacOS, Solaris

source: **API Interfaces:** rasql, C++, Java
ja: **API インターフェイス:** rasql, C++, Java

source: **Support:** https://rasdaman.com
ja: **サポート:** https://rasdaman.com

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/rasdaman_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/rasdaman_quickstart>`
